<?php

namespace Database\Seeders;

use App\Models\Terms;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class TermSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Terms::create([
            "description" => 'تدرك شركة وصلت للخدمات العقارية، وفروعها والشركات التابعة والمرتبطة بها أو مسؤوليها أو وكلائها أو الجهات التابعة لها أو من تتنازل لهم (يُشار إليها مجتمعة باسم "الشركة" أو "نحن" أو "ضمير المتكلم/الملكية")، أهمية خصوصية البيانات بالنسبة لك. لذا قمنا بإعداد هذه السياسة لمساعدتكم في تفهم طبيعة جمع واستخدام ومشاركة وكيفية التعامل مع هذه البيانات عند زيارتك أو استخدامك لمواقعنا. يرجى قراءة سياسة الخصوصية هذه بعناية عند دخولك و/أو استخدامك الموقع.
            تحتفظ الشركة بحق تعديل سياسة الخصوصية من وقت لآخر وستقوم بنشر أي تعديل على سياسة الخصوصية في هذه الصفحة. لا تلتزم الشركة بإخطارك بأية تعديلات ويجب عليك الاطلاع عليها من وقت لآخر، وتسري أي التعديلات اعتباراً من تاريخ نشرها على الموقع.
ينبغي أن تُقرأ سياسة الخصوصية هذه مع شروط الاستخدام الخاصة بنا وأي وثائق أخرى يشار إليها. (إن وجدت).
            ',
            "information" => json_encode([
                "معلوماتك الخاصة وتتضمن اسمك ورقم هاتفك وبريدك الإلكتروني وبيانات الدفع الخاصة بك",
                "اي معلومات أو المستندات أو منشورات يتم مشاركتها بواسطتك عبر الموقع.",
                "المعلومات الخاصة باهتماماتك حسب نشاطك على الموقع .",
                "عنوان بروتوكول الإنترنت (IP).",
                "معلومات خاصة بالجهاز، مثل (طراز الجهاز، وإصدار نظام التشغيل، ومعرفات الجهاز الفريدة، ومعلومات شبكة الهاتف الجوال بما في ذلك رقم الهاتف)."
            ]),
            "security" => 'إن حماية "معلوماتك الشخصية" ومنع الاطلاع غير المصرح به يعتبر أولوية قصوى بالنسبة لنا، ونحن نتخذ جميع الخطوات الضرورية في حدود المعقول لحمايتها من استخدام اختراق أو استخدام أو تعديل أو كشف أو إتلاف دون تصريح. وعلى الرغم من هذه التدابير الاحتياطية، فلا نستطيع أن تضمن عدم وصول الأشخاص غير المصرح لهم إلى بياناتك الشخصية، كما أننا لا نتحمل المسؤولية أي دخول غير مصرح به من جانب أطراف خارجية ولا نضمن الحماية والتأمين الكاملين للمعلومات الشخصية التي تقدمونها لنا.'
        ]);
    }
}
