<?php

return [
    "cities and areas" => [
        'تبوك' => ["الحي العسكري", "المدينة الصناعية", "الزاهر", "الصفا", "العزيزية"],
        'نجران' => ["المصانع", "الفيصلية", "الصفا", "النسيم", "الروضة"],
        'مكة' => ["الزاهر", "العزيزية", "الشرائع", "الربوة", "الراشدية"],
        'جازان' => ["الروضة", "الصفا", "الزهور", "العلياء", "الفيصلية"],
        'حائل' => ["الفيصلية", "الزهور", "الصفا", "الروضة", "الحي الجنوبي"],
        'عسير' => ["أبها الجديدة", "الضباب", "الفيصلية", "الوسطى", "الروضة"],
        'المنطقة الشرقية' => ["الدمام", "الخبر", "الظهران", "القطيف", "الجبيل"],
        'الرياض' => ["الملز", "السويدي", "الربوة", "الصحافة", "الروضة"],
        'القصيم' => ["بريدة", "عنيزة", "الرس", "البدائع", "الرياض"],
        'المدينة' => ["الفيصلية", "الزهور", "النسيم", "العوالي", "الراشدية"],
        'الجوف' => ["سكاكا", "القريات", "دومة الجندل", "طبرجل", "النعيرية"],
        'الباحة' => ["الفيصلية", "بلجرشي", "العقيق", "الطائف", "المندق"],
        'منطقة الحدود الشمالية' => ["عرعر", "طريف", "الحديثة", "رفحاء", "العويقيلة"]
    ]
];
